demo/pimple-pimple/topDomain/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       28500;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       28560;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       28620;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       28860;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          28800;
        startFace       29100;
    }
)

// ************************************************************************* //
